@echo off
title رفع المشروع الى GitHub
color 0B
echo =======================================================
echo          جاري رفع كود المنظومة الى حسابك في GitHub
echo =======================================================
echo.
git push -u origin main
echo.
if %ERRORLEVEL% EQU 0 (
    echo =======================================================
    echo           تم رفع المشروع بنجاح الى GitHub!
    echo =======================================================
) else (
    echo =======================================================
    echo  حدث خطأ في التسجيل، يرجى المحاولة مرة اخرى.
    echo =======================================================
)
pause
